==========================
Basic Function declaration
==========================

fn sum (a: Int, b: Int): Int {
  return a + b
}

---

(program
  (function_declaration
    (identifier)
    (parameter_list
      (parameter
        (identifier)
        (type_notation
          (signed_integer_type)))
      (parameter
        (identifier)
        (type_notation
          (signed_integer_type))))
    (type_notation
      (signed_integer_type))
    (block
      (return_statement
        (addition
          (identifier)
          (identifier))))))

==================================
Function declaration with defaults
==================================

fn product (a: Int, b: Int = 10): Int {
  return a * b
}

---

(program
  (function_declaration
    (identifier)
    (parameter_list
      (parameter
        (identifier)
        (type_notation
          (signed_integer_type)))
      (parameter
        (identifier)
        (type_notation
          (signed_integer_type))
        (default_value
          (integer))))
    (type_notation
      (signed_integer_type))
    (block
      (return_statement
        (multiplication
          (identifier)
          (identifier))))))

========================================
Basic Function call with named arguments
========================================

let result = sum(a=1, b=2)

---

(program
  (declaration
    (identifier)
    (function_call_expression
      (identifier)
      (argument_list
        (named_argument
          (argument_name)
          (value
            (integer)))
        (named_argument
          (argument_name)
          (value
            (integer)))))))

============================================
Basic Function call with partial application
============================================

let add_one = sum(a=1, b=_)
let result = add_one(b=2)
// result == 3

---

(program
  (declaration
    (identifier)
    (function_call_expression
      (identifier)
      (argument_list
        (named_argument
          (argument_name)
          (value
            (integer)))
        (named_argument
          (argument_name)
          (wildcard)))))
  (declaration
    (identifier)
    (function_call_expression
      (identifier)
      (argument_list
        (named_argument
          (argument_name)
          (value
            (integer))))))
  (comment))