====================
Simple Math Operator
====================

4 + 5

---

(program
  (expression_statement
    (addition
      (integer)
      (integer))))

======================
Test Simple Precedence
======================

4 + 5 * 2

---

(program
  (expression_statement
    (addition
      (integer)
      (multiplication
        (integer)
        (integer)))))

=====================
Test Group Precedence
=====================

(4 + 5) * 2

---

(program
  (expression_statement
  (multiplication
    (group
      (addition
        (integer)
        (integer)))
    (integer))))

===================================
Test Group Precedence with Negation
===================================

-(4 + 5) * 2

---

(program
  (expression_statement
    (multiplication
      (negation
        (group
          (addition
            (integer)
            (integer))))
      (integer))))