===============
Equals operator
===============

x == 42

---

(program
  (boolean_expr
    (identifier)
    (equality_operator)
    (integer))) 

===================
Not Equals operator
===================

x != 42

---

(program
  (boolean_expr
    (identifier)
    (equality_operator)
    (integer)))

==================
Less-than operator
==================

x < 42

---

(program
  (boolean_expr
    (identifier)
    (relational_operator)
    (integer)))

=====================
Greater-than operator
=====================

x > 42

---

(program
  (boolean_expr
    (identifier)
    (relational_operator)
    (integer)))

===========================
Less-than or equal operator
===========================

x <= 42

---

(program
  (boolean_expr
    (identifier)
    (relational_operator)
    (integer)))

==============================
Greater-than or equal operator
==============================

x >= 42

---

(program
  (boolean_expr
    (identifier)
    (relational_operator)
    (integer)))

============
And operator
============

0 <= x && x <= 10

---

(program
  (boolean_expr
    (boolean_expr
      (integer)
      (relational_operator)
      (identifier))
    (and)
    (boolean_expr
      (identifier)
      (relational_operator)
      (integer))))

===========
Or operator
===========

x == 0 || x == 42

---

(program
  (boolean_expr
    (boolean_expr
      (identifier)
      (equality_operator)
      (integer))
    (or)
    (boolean_expr
      (identifier)
      (equality_operator)
      (integer))))

============================
Not Operator with identifier
============================

!x

---

(program
  (boolean_expr
    (not)
    (identifier)))

==========================================
Not Operator with parenthesized expression
==========================================

!(x == 42)

---

(program
  (boolean_expr
    (not)
    (parenthesized_expression
      (boolean_expr
        (identifier)
        (equality_operator)
        (integer)))))

============================================
Comparison without right operand is an error
:error
============================================

x ==

---

(program
  (identifier)
  (ERROR
    (equality_operator)))

==============================================
Double negation without expression is an error
:error
==============================================

!!

---


(program
  (boolean_expr
    (not)
    (boolean_expr
      (not)
      (integer
        (MISSING _digit_sequence)))))

==============================================
And operator without right operand is an error
:error
==============================================

x && 

---

(program
  (identifier)
  (ERROR
    (and)))   