===============
Property Access
===============

let name = person.name

---

(program
  (declaration
    name: (identifier)
    value: (member_expression
      object: (identifier)
      property: (identifier))))

==============
Array Indexing
==============

let first = array[0]

---

(program
  (declaration
    name: (identifier)
    value: (index_expression
      object: (identifier)
      index: (integer))))

==========================
Chained Postfix Operations
==========================

let foo = struct.function()[0].property

---

(program
  (declaration
    (identifier)
    (member_expression
      (index_expression
        (call_expression
          (member_expression
            (identifier)
            (identifier))
          (argument_list))
        (integer))
      (identifier))))

============
Try Operator
============

let file = open_file("foo.txt")?

---

(program
  (declaration
    (identifier)
    (try_expression
      (call_expression
        (identifier)
        (argument_list
          (value
            (string_literal
              (string_content))))))))

==============================
Try Operator with Property Access
==============================

let name = get_user(id)?.profile.name

---

(program
  (declaration
    (identifier)
    (member_expression
      (member_expression
        (try_expression
          (call_expression
            (identifier)
            (argument_list
              (value
                (identifier)))))
        (identifier))
      (identifier))))

=========================
Chained Try Operators
=========================

let data = open_file(path)?.read()?.parse()?

---

(program
  (declaration
    (identifier)
    (try_expression
      (call_expression
        (member_expression
          (try_expression
            (call_expression
              (member_expression
                (try_expression
                  (call_expression
                    (identifier)
                    (argument_list
                      (value
                        (identifier)))))
                (identifier))
              (argument_list)))
          (identifier))
        (argument_list)))))

=================================================
Property access without property name is an error
:error
=================================================

foo.

---

(program
  (identifier)
  (ERROR))

===============================================
Array index without closing bracket is an error
:error
===============================================

arr[0

---

(program
  (postfix_expression
    (identifier)
    (integer)
    (MISSING "]")))

==========================================
Array index without expression is an error
:error
==========================================

arr[]

---

(program
  (postfix_expression
    (identifier)
    (integer
      (MISSING _digit_sequence))))

==============================================
Function call with unclosed parens is an error
:error
==============================================

foo(1, 2

---

(program
  (postfix_expression
    (identifier)
    (function_call
      (value
        (integer))
      (value
        (integer))
      (MISSING ")"))))
