========================================
Basic Function call with named arguments
========================================

let result = sum(a=1, b=2)

---

(program
  (declaration
    (identifier)
    (call_expression
      (identifier)
      (argument_list
        (named_argument
          (argument_name)
          (value
            (integer)))
        (named_argument
          (argument_name)
          (value
            (integer)))))))

============================================
Basic Function call with partial application
============================================

let add_one = sum(1, _)
let result = add_one(b=2)
// result == 3

---

(program
  (declaration
    (identifier)
    (call_expression
      (identifier)
      (argument_list
        (value
          (integer))
        (wildcard))))
  (declaration
    (identifier)
    (call_expression
      (identifier)
      (argument_list
        (named_argument
          (argument_name)
          (value
            (integer))))))
  (comment))

===
call with space
===

f ()

---

(program
  (call_expression
    (identifier)
    (argument_list)))

===
qualified call with space
===

ns.f ()

---

(program
  (call_expression
    (member_expression
      (identifier)
      (identifier))
    (argument_list)))
